app/controllers/home_controller.rb

INSERT INTO `user_movie_locations` (`created_at`, `movie_location_id`, `updated_at`, `user_id`) VALUES ('2015-03-21 14:23:31', 1, '2015-03-21 14:23:31', 1)
INSERT INTO `users` (`created_at`, `email`, `updated_at`) VALUES ('2015-03-21 14:16:20', 'manojmj92@gmail.com', '2015-03-21 14:16:20')
SELECT  `user_movie_locations`.* FROM `user_movie_locations`  WHERE `user_movie_locations`.`user_id` = 1 AND `user_movie_locations`.`movie_location_id` = 1 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'manojmj92@gmail.com' LIMIT 1
---
	def create
		user_movie_location_params = {
					:user_id => (User.find_or_create_by(:email => params.delete(:email))).id,
					:movie_location_id => (MovieLocation.find_or_create_by(create_associations(params))).id